{
    "author": ["Star"],
    "name": "AutoDocSite",
    "install_msg": "Thank you for installing the AutoDocSite cog!\n\nThis cog automatically generates a documentation site for your bot's cogs using GitHub Pages and MkDocs.  If you want to help translate, go to my [crowdin](<https://crowdin.com/project/Star-Cogs>)\nIf you like my work, [donate me!](<https://ko-fi.com/starcogs>)\n\n```txt\nBelow are the steps to set it up:\n\n1. **Set Repository Directory**\n   - Use the command `[p]setsite repo_dir <path>` to set the directory where your documentation repository is located on your host server. This is where the generated documentation files will be stored.\n\n2. **Configure GitHub Personal Access Token (PAT)**\n   - Go to your GitHub account settings, navigate to Developer settings > Personal Access Tokens > Tokens (Classic), and generate a new token.\n   - Ensure the token has full access to the 'Repo' scope, which is necessary for pushing changes to your GitHub repository.\n\n3. **Install MkDocs and Theme**\n   - Ensure MkDocs and the desired theme (e.g., `mkdocs-dracula-theme`) are installed on your server. You can install them using pip:\n     ```\n     pip install mkdocs mkdocs-dracula-theme\n     ```\n\n4. **Set Site Configuration**\n   - Use the various `[p]setsite` commands to configure your documentation site settings, such as `site_name`, `custom_domain`, `theme_name`, etc.\n\n5. **Build and Deploy Documentation**\n   - Once all settings are configured, navigate to your local repository directory and run the following commands to build and deploy your site:\n     ```\n     mkdocs build\n     mkdocs gh-deploy\n     ```\n   - When prompted for your GitHub username and password, use your username and the generated PAT as the password.\n\n6. **Verify Deployment**\n   - After deployment, your documentation site should be live on GitHub Pages. Check your GitHub repository's settings to ensure the Pages feature is enabled.\n\n7. **Enjoy Easy Documentation Generation!**\n   - With everything set up, you can now generate and update your documentation site effortlessly.\n\nFor help with commands, use `[p]help AutoDocSite`. If you'd like to contribute translations, visit our [Crowdin project](https://crowdin.com/project/Star-Cogs).\n\nHappy documenting!```",
    "short": "Automatically generates documentation site",
    "description": "Automatic generation of documentation using GH-Pages and MkDocs.",
    "tags": [
        "auto_doc_gen"
    ],
    "requirements": [
        "git+https://github.com/LeDeathAmongst/Star_Utils.git",
        "mkdocs",
        "mkdocs-dracula-theme",
        "pandas",
        "aiocache",
        "pyyaml"
    ],
    "min_bot_version": "3.5.11",
    "end_user_data_statement": "",
    "hidden": false
}
